Autodesk.Revit.UI.BrowserUtility.GetElementModifiedDate(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets element modified date.
document:
The document.
id:
The element id.
Returns:
The modified date.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.BrowserUtility.IsInAssemblyEditMode(Autodesk.Revit.DB.Document)
Tests if a document is currently in assembly edit mode.
Remarks:
For public API is not supported in edit mode, so this method prefer to use only in internal programming.
document:
The document to test.
Returns:
True if the document is in assembly edit mode, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.BrowserUtility.IsInEditMode(Autodesk.Revit.DB.Document)
Tests if a document is currently in edit mode.
Remarks:
For public API is not supported in edit mode, so this method prefer to use only in internal programming.
document:
The document to test.
Returns:
True if the document is in edit mode, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.BrowserUtility.IsInGroupEditMode(Autodesk.Revit.DB.Document)
Tests if a document is currently in group edit mode.
Remarks:
For public API is not supported in edit mode, so this method prefer to use only in internal programming.
document:
The document to test.
Returns:
True if the document is in group edit mode, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.BrowserUtility.MayBeVisibleInBrowser(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementType)
Tests if an element type may be visible in family browser.
Remarks:
This method does the quick visibility check in family browser. so it prefers to use only in internal programming.
document:
The document to test.
elementType:
The ElementType to check.
Returns:
True if the element type may be visible in family browser, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.UI.BrowserUtility.IsInSystemLayoutPathEditMode(Autodesk.Revit.DB.Document)
Tests if a document is currently in system layout path edit mode.
Remarks:
For public API is not supported in failure mode, so this method prefer to use only in internal programming.
document:
The document to test.
Returns:
True if the document is in system layout path mode, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.UI.BrowserUtility.IsInFailureMode(Autodesk.Revit.DB.Document)
Tests if a document is currently in failure mode.
Remarks:
For public API is not supported in failure mode, so this method prefer to use only in internal programming.
document:
The document to test.
Returns:
True if the document is in failure mode, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.UI.BrowserUtility.IsInStairsEditMode(Autodesk.Revit.DB.Document)
Tests if a document is currently in stairs edit mode.
Remarks:
For public API is not supported in edit mode, so this method prefer to use only in internal programming.
document:
The document to test.
Returns:
True if the document is in stairs edit mode, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.UI.BrowserUtility.IsInSketchMode(Autodesk.Revit.DB.Document)
Tests if a document is currently in a sketch mode.
Remarks:
For public API is not supported in edit mode, so this method prefer to use only in internal programming.
document:
The document to test.
Returns:
True if the document is in sketch mode, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.UI.BrowserUtility.DisplayTypePropertiesDialog
Display the Type Properties dialog for selected elements to edit the type properties parameters.
Since:
2015

Autodesk.Revit.UI.BrowserUtility.WriteIntegerRevitIniOption(System.String,System.String,System.Int32)
Write an integer value to Revit.ini based on the sectionName and entryName.
sectionName:
The section name.
entryName:
The entry name.
value:
The value of the entry.
Returns:
True if the value is set successfully, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.UI.BrowserUtility.GetIntegerRevitIniOption(System.String,System.String,System.Int32)
Get an integer value from Revit.ini based on the sectionName and entryName.
Remarks:
If there is a value, but not an int, it will return the default value.
sectionName:
The section name.
entryName:
The entry name.
defaultValue:
The default value to return if the entry does not have a value.
Returns:
The value of the entry.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.UI.BrowserUtility.SaveFamily(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Save the document for a load family.
document:
The currently active Document.
familyId:
The id of the loaded family to reload.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document has an open editing transaction and is accepting changes.
-or-
document is read-only: It cannot be modified.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The input id is not for a loaded family or the input id is for an in-place family.
-or-
SaveFamily is not allowed in the current application mode.
Since:
2015

Autodesk.Revit.UI.BrowserUtility.ReloadFamily(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Reload the document for a loaded family.
document:
The currently active Document.
familyId:
The id of the loaded family to reload.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document has an open editing transaction and is accepting changes.
-or-
document is read-only: It cannot be modified.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The input id is not for a loaded family or the input id is for an in-place family.
Since:
2015

Autodesk.Revit.UI.BrowserUtility.IsDisableSaveStatusDebugModeOn
indicate whether DisbaleSaveStatus debug mode is on.
Returns:
True if this debug mode is on, false otherwise.
Since:
2015

Autodesk.Revit.UI.BrowserUtility.IsJournalReplaying
Indicate whether it is in journal replaying mode.
Returns:
True if it is in journal replaying mode, false otherwise.
Since:
2015

Autodesk.Revit.UI.BrowserUtility.EditAndActivateFamilyDocument(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Edit and activate the document for a loaded family.
document:
The currently active Document.
familyId:
The id of the loaded family to edit.
Returns:
The opened family document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document has an open editing transaction and is accepting changes.
-or-
document is read-only: It cannot be modified.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The input id is not for an editable loaded family or the input id is for an in-place family.
Since:
2015

Autodesk.Revit.UI.BrowserUtility.CreateDefaultFamilySymbol(Autodesk.Revit.UI.UIDocument,Autodesk.Revit.DB.ElementId,System.String)
Create new family symbol with the input symbol name by default parameter of the input family.
uiDoc:
The UIDocument.
familyId:
The id of the input family.
symbolName:
The family symbol name.
Returns:
The id of the created family symbol.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This document is not the currently active one.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.UI.BrowserUtility.StartArrowEditor(Autodesk.Revit.UI.UIDocument)
Start the arrow editor.
uiDoc:
The currently active UIDocument.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This document is not the currently active one.
-or-
Starting a new transaction is not permitted. It could be because
another transaction already started and has not been completed yet,
or the document is in a state in which it cannot start a new transaction.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.UI.BrowserUtility.DocumentAllowChange(Autodesk.Revit.DB.Document)
Check if the document is allowed to change in its current status.
For example, the document is not allowed to change when it is in edit mode, group mode, failure mode, paste mode, etc.
doc:
the document to check
Returns:
True if the document is allowed to change, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.UI.BrowserUtility.CanCreateInstance(Autodesk.Revit.UI.UIDocument,Autodesk.Revit.DB.ElementType)
Verifies that the user can create an instance of the input element type on the active view.
uiDoc:
The UIDocument.
elementType:
The ElementType.
Returns:
True if the user can create an instance of the input element type on the active view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.UI.BrowserUtility.DeleteElementsAndOrPostWarnings(Autodesk.Revit.DB.Document,System.Boolean)
Delete elements and post warnings if necessary
This API is an temporary for long list project
doc:
the document from which the elements will be deleted
bCheckForDeletingAllOpenViews:
whether to check for deleting all open views
Returns:
True if the deletion successes, otherwise, false
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.UI.BrowserUtility.DeleteFamiliesAndOrPostWarnings(Autodesk.Revit.DB.Document,System.Collections.Generic.IList`1{Autodesk.Revit.DB.ElementId})
Delete families and post warnings if necessary
This API is an temporary for long list project
doc:
the document from which the families will be deleted
familyIds:
Ids of families to be deleted
Returns:
True if the deletion successes, otherwise, false
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.UI.BrowserUtility.IsFamilySurrogateBase(Autodesk.Revit.DB.Element)
Identifies if the given element is a surrogate for family based element.
pElementTocheck:
the element to check
Returns:
True if the given element is a surrogate for family based element, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.UI.BrowserUtility.IsSurrogate(Autodesk.Revit.DB.Element)
Identifies if the given element is a surrogate
pElementTocheck:
the element to check
Returns:
True if the given element is a surrogate, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.UI.BrowserUtility.GetElementIdFromSurrogateElement(Autodesk.Revit.DB.Element)
Get the surrogated element id of the given surrogate element.
pSurrogateElement:
the surrogate element
Returns:
The element id of the surrogated element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element is not a surrogate.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.UI.BrowserUtility
One utility class mainly used for browsing the project with API layer access.
Since:
2015